<?php

    // $max = 5;


    // for ($n1 = 0; $n1 <= $max; $n1++) 
    // { 
    //     for ($blank = $max - $n1; $blank > 0; $blank--) 
    //     { 
    //         echo " ";
    //     }
    //     for ($n2 = 0; $n2 < $n1; $n2++) 
    //     { 
    //         echo "★";
    //     }
    //     echo "\n";
    // }

    // for ($n1 = 0; $n1 <= $max; $n1++) 
    // { 
    //     for ($blank = $max - $n1; $blank > 0; $blank--) 
    //     { 
    //         echo " ";
    //     }
    //     for ($n2 = 0; $n2 < $n1; $n2++) 
    //     { 
    //         echo "*";
    //     }
    //     echo "\n";
    // }

    // $n = 6;

    // for ($i = 0; $i < $n; $i += 2) {
    //     //입력한 수만큼 오른쪽으로 삼각형 땡겨줌
    //     for ($a = 0; $a < $n; $a++) {
    //         echo "  ";
    //     }
    //     //나머지는 마름모할때 윗부분삼각형과 동일함
    //     for ($j = $n; $j >= $i; $j -= 2) {
    //         echo "  ";
    //     }
    //     for ($star = 0; $star <= $i; $star++) {
    //         echo "* ";
    //     }
    //     echo "\n";
    // }

    // /*
    //  *   중단
    //  * */
    // $count = $n * 3; //중단의 최대길이

    // for ($i = 0; $i < $n / 2 + 1; $i++) { //높이를 입력한 크기의 2분의1정도로 하여 균형을 맞춤
    //     echo"  ";   //줄맞춤용
    //     for ($j = 0; $j < $i; $j++) { // i의 크기만큼 공백을 줘서 별이 찍힐 시작점을 맞춤(i는 1씩 증가하니깐 공백도 1씩 증가
    //         echo "  ";
    //     }
    //     for ($k = 0; $k < $n * 3; $k++) { //입력한 크기의 3배만큼 별을 찍어야함
    //         if ($k < $count) {    //단, count라는 개수보다 적을때만 별을 찍음(count는 별의 개수를 나타내는 변수임, 2개씩 줄어들게 해놨음)
    //             echo"* ";
    //         }

    //     }
    //     //몸통 한줄 더 키울려고 추가함
    //     if($i == $n/2){
    //         echo "\n";
    //         echo "  ";   //줄맞춤용
    //         for ($j = 0; $j < $i; $j++) { // i의 크기만큼 공백을 줘서 별이 찍힐 시작점을 맞춤(i는 1씩 증가하니깐 공백도 1씩 증가
    //             echo "  ";
    //         }
    //         for ($k = 0; $k < $n * 3; $k++) { //입력한 크기의 3배만큼 별을 찍어야함
    //             if ($k < $count) {    //단, count라는 개수보다 적을때만 별을 찍음(count는 별의 개수를 나타내는 변수임, 2개씩 줄어들게 해놨음)
    //                 echo "* ";
    //             }

    //         }
    //     }

    //     $count -= 2; //다음에 찍힐 별을 2개줄임
    //     echo "\n";
    // }

    // /*
    //  *    하단
    //  * */
    // $count = $n;//왼쪽밑둥용(중단에서 사용한거 재활용)
    // $count2 = 0;//오른쪽밑둥용
    // for ($i = 0; $i < $n/2+1; $i++) {   //하단줄의 개수를 밑변개수의 절반만큼으로함
    //     echo "  ";
    //     for ($j = $i; $j < $n / 2; $j++) {   //절반만큼의 공백을 띄움
    //         echo "  ";
    //     }
    //     //별(왼쪽밑)
    //     for ($k = 0; $k < $n; $k++) { //입력개수만큼 별찍기를하는데 k가 count보다 작을때만 별을 찍음
    //         if ($k < $count) {
    //             echo "* ";
    //         } else {
    //             echo "  ";
    //         }
    //     }
    //     echo "  "; //정가운데 공백

    //     //count2를 이용해 오른쪽밑둥을 오른쪽을 떙겨줌
    //     for ($j = 0; $j < $count2; $j++) {
    //         echo "  ";
    //     }
    //     //별(오른쪽밑)
    //     for ($k = 0; $k < $n; $k++) {
    //         if ($k < $count) {
    //             echo "* ";
    //         } else {
    //             echo "  ";
    //         }
    //     }

    //     $count -= 2;
    //     $count2 += 4;
    //     echo "\n";
    // }



    // 육망성
    
    // for($n1 = 0; $n1 < 3; $n1++)
    // {
    //     for($n2 = 0; $n2 < 10 + $n1; $n2++)
    //         {
    //             if($n2 < 9 - $n1)
    //                 echo(" ");
    //             else
    //                 echo("*");
    //         }
    //     echo("\n");
    // }

    // for($n1 = 0; $n1 < 4; $n1++)
    // {
    //     for($n2 = 0; $n2 < 19 - $n1; $n2++)
    //         {
    //             if($n2 < $n1)
    //                 echo(" ");
    //             else
    //                 echo("*");
    //         }
    //     echo("\n");
    // }

    // for($n1 = 3; $n1 > 0; $n1--)
    // {
    //     for($n2 = 0; $n2 < 19 - $n1 + 1; $n2++)
    //         {
    //             if($n2 < $n1 - 1)
    //                 echo(" ");
    //             else
    //                 echo("*");
    //         }
    //     echo("\n");
    // }

    // for($n1 = 2; $n1 >= 0; $n1--)
    // {
    //     for($n2 = 0; $n2 < 10 + $n1; $n2++)
    //         {
    //             if($n2 < 9 - $n1)
    //                 echo(" ");
    //             else
    //                 echo("*");
    //         }
    //     echo("\n");
    // }


?>